{
    "Woodcutting":[
        "you approach the Lumbridge canoe station to find Moddi has already chopped down the tree, carved a canoe, and paddled upriver. You see his stupid striped sleeping cap in the distance. The tree doesn’t respawn for another 20 minutes, so you’ll have to walk all the way to Varrock.",
        "while chopping yew trees in Seers’ Village, you notice Moddi a few tiles away, hacking away at the willows. A beaver approaches him, seeking companionship. You hear Moddi screeching that he got a pet before you did. A powerful rage washes over you.",
        "in passing, Moddi drops his lumpy forestry kit on your foot. It was full to the top with redwood logs…",
        "after felling a tree nearby, Moddi snaps a branch from it and chucks it at your head. It gets impossibly caught in your hair, because of course it does. The Falador Hairdresser takes one look at the state of your tangled mane and suggests shaving it all off to avoid the migraine of detangling. Two hours and 500 gold coins later, you emerge from the barber’s chair as little more than a reminder that Northernlion exists.",
        "you head off to the Tar Swamps to collect some sulliuscep mushrooms with your woodcutting axe. Unfortunately, everytime you arrive at a possible spawn location, you find a stump where a sulliuscep used to be. After several hour of running laps around the island finding only stumps instead of choppable mushrooms, you see Moddi ahead of you, and realize that he has been chopping down your mushrooms all afternoon." 

    ],

    "Combat":[
        "later that day, you decide to check your Grand Exchange trade offers. Hidden from view behind a Dwellberry bush, Moddi casts the highly dangerous Humidify spell in your direction. A terrifying storm cloud appears, stopping just as it reaches your head. A giant crack of thunder erupts from the storm cloud, causing you to pee your pants. You are now the laughing stock of the Grand Exchange.",
        "Moddi spends an entire afternoon casting Fire spells on the poor combat dummy in your basement, nearly causing your entire house to burn down.",
        "Moddi convinced a hungry ogre to hide inside your compost bin. You get viciously attacked as you open it.",
        "Moddi has decided to take your prized Helm of Neitiznot to the Archery Guild for a spot of target practice. He shoots over a hundred steel arrows into it. At least he was considerate enough to wait until your head was no longer inside it.",
        "Moddi has informed the highly aggressive Thrower Trolls of Death Plateau that you are the greatest baseball player in ModdiScape. Oblivious to the lie, the trolls invite you to spring training. The star pitcher, Dad, delivers a 128mph fastball squarely to your lower intestine, sending you to Lumbridge instantly.",
        "just days before the annual ModdiScape Cosplay Contest, Moddi decides to flip the script on the partner costume you’re sharing with him. He gives you the Lesser Demon outfit, and claims the Greater Demon outfit for himself. This shreds your ego like a cabbage at a coleslaw convention.", 
        "oh dear! You’ve come down with a nasty case of Rune Flu. Moddi hears about this through the grapevine and decides to give you a break by taking care of your chores. He washes your bedsheets, gives all of your pets a bath (even the bitey ones), mops every inch of your floors, and puts a big pot of homemade curry on the stove to simmer away. What you didn’t know is that Moddi is a carrier and shameless superspreader of Runemonia. He sneezes into the pot of curry. You are none the wiser when he serves you a bowl; you are not taking poison chip damage.",
        "upon waking up to a sudden pain in your hand, you discover a passle of zombie rats infesting your home, with a note from Moddi nailed to the wall saying, 'You’re Welcome!'" 
    ],
    
    "Fishing":[
        "while you were busy questing, Moddi cut the bottoms out of every single one of your fishing nets.",
        "Moddi spent so many hours fishing lobsters on Catherby beach that there are simply no more lobsters left for you.",
        "Moddi has convinced a pigeon to cosplay as a heron and pretend to be your new Fishing pet. He watches and laughs as his plan unfolds - the heron appears, your eyes light up with excitement, you send screenshots to your Discord friends…. only to have it all washed away as you uncover moments later the zipper on the back of the bird. The pigeon, now free, eats the fishing bait right out of your backpack.",
        "while you are busy having lunch, Moddi sneaks up to your lobster pots and adds some dark fishing bait. When you check the pots later, they are full of dark crabs instead of the lobster you were expecting, at which point Moddi pops out of a nearby bush and runs away laughing."

        
    ],

    "Mining":[
        "as you cautiously make your way over White Wolf Mountain, you hear an all-too-familiar clank sound, followed by the somehow-even-more-familiar sound of a rockslide. You manage to outrun it, but as you direct your gaze towards the peak of the mountain, dust settling around you, you see the unmistakable silhouette of Moddi holding his pickaxe.",
        "while bounding through the Feldip Hills in your lightweight armor, you spot something shimmering on the ground. It looks like a ruby - or maybe a red topaz. You notice it’s thoroughly stuck in a piece of rock, and sprint to get your pickaxe from the bank in Yanille. By the time you return, the alluring gem is gone, and you can hear Moddi whistling as he steps onto a Fairy Ring and disappears.",
        "You attempt to climb the crumbling wall in Falador, hoping to get to the other side without ripping your pants. It’s an unusually difficult task for you today - the obstacle seems to have gotten taller. Just as you start contemplating another route to the other side of the wall, you hear another brick tumble onto the pile of rubble. And another. And another. Finally, you see the glint of a pickaxe as it strikes a fourth brick. At this point, it’s not even necessary to guess whose doing this is.",
        "while you are walking through the mine, Moddi 'accidentally' trips you, causing you to stumble headfirst into an ore node, cracking it open with your sanguine Torva full helm."

    ],

    "Cooking":[
        "Moddi swipes every egg in your larder for his meal-prepping needs. No morning omelette for you today.",
        "Moddi stuck some extra firewood in your stove while you were occupied with your pets in the garden. You place some bread dough on the stove, light it, and instantly burn your bread, leaving it charred on the outside and raw on the inside. Gross.",
        "today, you’ve been convinced by Moddi that making sushi is easy. He hands you a slimy piece of seaweed, straight off the beaches of Piscatoris. 'Now just wrap it tightly in this stuff,' he says. 'It’s tasty!' You take a bite of finished sushi and wake up in Lumbridge, completely disoriented and with horrible breath.",
        "Moddi bakes a meat lover’s pizza in your living room fireplace, but makes no effort to clean up after himself. The smell of burning cheese and bacon grease haunts you.",
        "Moddi volunteers to bake you a birthday cake for your birthday! He says it’s strawberry, but the cake is a lie. It’s actually chocolate."

        
    ],

    "Hunter":[
        "While your Demon Butler is on vacation, Moddi sneaks into your house and feeds a laxative to your pet pheasant. This can only end poorly.",
        "under the cover of night, Moddi unleashes his army of well-trained rabbits onto your farming allotments, destroying your cabbage sprouts.",
        "your Demon Butler informs you that a group of guests has arrived at your house. You ask how many, to which the butler replies, 'about a hundred.' You rush over to greet your admirers, only to find a herd of Sunlight Antelopes feasting on your garden plants. Moddi emerges wearing his stupid combination-safari-and-naptime hat, smug as ever.",
        "just hours before your biggest house party of the year, Moddi covertly constructs a deadfall trap in the corner of your garden. Your pet raccoon, curious as ever, falls for the trap and gets stuck in the deadfall pit. Your young snakeling, hearing the commotion, slithers over to the pit and also falls in. Eventually, you find all 55 of your pets dancing and partying the night away in the pit, like it’s some sort of Dirt Disco. You don’t remember buying RGB strobe lights… or a fog machine…", 
        "while you aren’t looking, Moddi switches the farm-fresh cheese you just bought with Pasteurized Processed Cheese Product. This leads to an enormous argument and falling-out with your pet rats. The entire brigade of them relocates to Moddi’s attic, dedicating themselves to servitude.", 
        "You place a scarecrow between your sweetcorn allotments. What you didn’t know is that California Crows are specially bred to be immune to the trickery of scarewcows. And you’ll never guess who owns an aviary with dozens of California Crows as residents AND knows your crop rotation schedule!",
        "you awake to an unusually large amount of birdsong outside your window, with the occasional unhappy squawk. The easily recognizable bootprints at the edge of your yard let you deduce that it was Moddi who surrounded your house in a moat of birdseed and birdhouses in the night."

    ],

    "Construction":[
        "earlier that day, Moddi made his way down to the Lumbridge Castle basement, where one of your bank chests sits in a corner. Cackling to himself, he nails AND glues the chest shut. Now you’ll have to use the bank booth at the very top of the castle instead…",
        "at the same time every day for the past few weeks, Moddi has sneakily replaced a different door hinge in your house with a noticeably more squeaky one.",
        "Moddi has barricaded your house portal while you weren’t looking. You’re stuck inside your house, and nobody can hear you yell for help.",
        "your annual POH (Player-Owned House) inspection is scheduled for today. Unbeknownst to you, Moddi’s dad is the one carrying out the inspection. He goes through your property with a fine-tooth comb, assessing and flagging every crack and loose floorboard as problematic. Hmm… you never noticed these things until today. To make a long story short, you have three days to make repairs, or you and your house will be re-zoned to the deep Wilderness, right next to the moody Chaos Elemental and the Hellhound Lair.",
        "you were so engrossed in your prayer that you don’t notice Moddi turning your house into a mini maze with an excessive amount of Oak Larders placed everywhere."
        
    ],

    "Prayer":[
        "as you stand at the bank, fletching arrows, minding your own business, Moddi comes along and throws a hot cup of tea on your freshly-washed monk robes. You suddenly feel vulnerable and lightheaded, as if a bit of otherworldly protection has left you.",
        "while standing at the Grand Exchange, you see Moddi practicing Firemaking from the corner of your eye. His sleeve catches fire, causing him to panic, and you to laugh to yourself a little. Moddi somehow senses this, and prays for Vengeance. A quick but searing fire whips your face, burning off your eyebrows.",
        "later that day, as you tend to your patch of strawberries, Moddi whizzes by and stealth-blesses your crops. The strawberries begin to swell and grow uncontrollably as an unstoppable godly magic swirls around them. One by one, and in the blink of an eye, the strawberries explode, covering you in chunks and goop as if you were a piece of morning toast.",
        "Moddi notices you’re feeling rundown and out of luck. He decides to recite a prayer in front of you to help turn the tides of your miserable life. You catch on very quickly to the fact that he used RuneGPT to write the verses for him, but don’t want to interrupt. By the end of it, you somehow feel even worse. Way to go, Moddi.",
        "on your way back to Stonecutter Outpost the next morning, you see Moddi scattering the ashes of the imps you killed the night before. 'Thanks for the xp!' he calls as he bounces away on an enchanted pogostick."
    ],

    "Crafting":[
        "Moddi spent an afternoon carving a custom Runesquares board. To test it out, he invites you to a game. You win, best-of-three, and laugh in his face. Moddi smacks you across the head with his Prayer book. Your face has slightly fewer polygons now.",
        "as you put on your leather gloves for another hard day of slaying monsters and touching digusting medieval surfaces, you notice a sharp pain in your fingers. Surprise! Moddi glued some cactus spines inside your gloves (he even used the ‘good’ glue.)",
        "Moddi has replaced all of the cloth ccoverings on your Prayer altar with extra-flammable replicas, which he hand-sewed and embroidered in his spare time. Too bad you need all those candles lit to receive the XP bonus when you kneel at the altar…",
        "the crafty monkeys of Ape Atoll spent today teaching Moddi how to fashion a coconut tambourine. No more restful Sunday mornings for you, pal.", 
        "with his trusty needle and thread, Moddi stitches every single one of your capes together, end to end, creating a Mega Cape. Despite its cool name, it’s too heavy and awkward to wear. It’s like he knew…",
        "you wake up one morning to find your hops patch bare of crops, and see Moddi off in the distance throwing a newly crafted drift net into the river."
    ],

    "Thieving":[
        "Cor blimey, mate! What’s Moddi doing in yer pockets? Stealing your 426 blood runes - that’s what.",
        "Moddi has stolen every single one of your handmade clay bowls. Those were sentimental, and the only thing you could serve salad in.",
        "You become so entranced by the act of stealing from a fruit stall that you don’t notice Moddi stealing from your backpack. He takes all of your money, and that Fish Pie you just made.",
        "Moddi picks the lock to your bedroom door and removes the candle from your bedside candlestick. Good luck getting to the bathroom at 3am.",
        "Moddi challenges you to a race through the Rogue’s Den - a brutal maze full of traps, puzzles, and dangerous obstacles. You’re neck-and-neck for most of the run, feeling strong, but terrifyingly, a spinning sawblade springs from a corridor wall and slices your arm off just as you reach a checkpoint. Moddi grabs your severed arm and uses its pinky to pick the lock of the final door of the maze, then saunters into the victory chamber, waving your arm like a drunken Ren Faire attendee with a greasy turkey leg. Jeez. Rude.",
        "Moddi sees your cabbage stockpile sitting in your wagon awaiting delivery to market and decides to steal all of them to make garden pies." 
    ],

    "Farming":[
        "you sail to Brimhaven to check on your newly-grown Palm Tree, only to see it has born zero coconuts. On the rocky hills to the east, you spot a smeared, paint-stroke blotch of a moving human body as it grapples away like low-poly Batman. Moddi…", 
        "upon entering the Hosidius farm, you notice that all of your watermelons are dead. To make matters worse, the Nasturtium flowers have been cleared out and replaced with some sort of fake imposter flower. They don’t smell nearly as nice. Nearby, you witness Moddi skipping across the river stones in the distance, clutching a bundle of little red blooms.", 
        "whilst you were busy getting a set of armor fitted, Moddi managed to convince the Farming Tools Leprechaun that he was you. He mimicked your voice perfectly - impressive. At the end of the haul, he made off with all of your tools and Plant Cure Potions. Moddi has taught you a valuable lesson about securing your items behind a four-digit PIN.", 
        "throughout the day, Moddi made his way to each of your allotments to unleash some ancient secrets of evil Zamorakian magic. Who knew anti-compost was a thing? You sure didn’t, until now. All of your crops stink of rot.", 
        "it would seem that while you were busy bankstanding, not paying a single grain of attention, Moddi dumped the entire contents of your Seed Box onto the ground, which not only fed the local rodents, but also passively planted several intrusive species in the area. After finding all of this out on your own, you feel a tremendous urge to turn ol’ Farmer Brown into Farmer Black and Blue.", 
        "in celebration of your new Farming adventures, Moddi gifts you a scarecrow, leaning it against the wall in the corner of your bedroom (but not before taking it to Aggie the Witch to have it imbued with the worldly-departed soul of a nocturnal tap dancer). Surprise!",
        "due to a bad string of Moddiluck, Moddi hasn’t gotten any seed drops all day, so settles for running around raking the weeds out of every farming plot he can find."
    ]
}