{
    "Woodcutting":[
        "you approach the largest tree in the game - the redwood located in the Woodcutting Guild. The ladder looks rickety, but you climb it anyway and begin chopping...",
        "you fancy a canoe ride to Ferox Enclave. You grab your axe, chop down the mighty tree at the canoe station, and carve a sturdy Waka canoe with ease.",
        "the birds singing woke you up early this morning. You figure you might as well get some work done. You chop every oak tree you can find in Lumbridge.",
        "the Draynor Village willow tree spot is popping with conversation today. You decide to spend five hours chopping.",
        "while chopping willows in Draynor Village, a beaver approaches. Unfortunately, it wasn't there to befriend you. You decide to keep chopping for a few more hours, just in case another beaver comes along.",
        "you chop a single tree and receive a single log. Wow.",
        "you've upgraded your woodcutting axe from steel to mithril. Chopping willows feels a little faster.",
        "you become lost in thought as you chop yews in Seers' Village. Hours pass. Maybe days?",
        "you haphazardly attempt to chop a tree in the Enchanted Valley. A Tree Spirit appears, clearly unhappy with you. With your trusty axe, you 'cut' its life short. Haha. Cut.",
        "a unicorn spots you as you paddle down the River Lum in your hand-carved canoe. A sense of pride washes over you. You feel as though you're sparkling and magical, just like the unicorn.",
        "you take your first swing at a maple tree. You wonder when you'll be able to tap it for syrup.",
        "you complete your first Forestry event: nursing a failing oak sapling back to health. You receive some Anima-infused bark.",
        "you complete the Dryad's ritual, surrounded by glittering magic trees and cute forest critters. The Dryad hands you her flower necklace. How beautiful!",
        "while attending a house party in Rimmington, the house owner's beaver pet approaches you from the menagerie. It seems to know you have some logs in your backpack. You give it a little pat. Maybe it misses the forests it grew up in?",
        "an elderly stranger in Catherby asks if you'd be so kind as to chop down his apple tree for him. You agree. He gives you two fresh apples for your time.",
        "the Sawmill Operator contracts you to chop 200 oak logs and place them neatly in a pile. The stacking, somehow, takes longer than the chopping.",
        "the zookeeper wants to build a wooden enclosure for the new capybara exhibit. You agree to chop 300 teak logs for the project.",
        "you decide you want to change the flooring in your house to something that screams 'I'm rich and you're not!' - some pure mahogany planks should do the trick. You chop a thousand mahogany trees and pay the Sawmill Operator to turn the logs into floorboards.",
        "while chopping the giant redwood at the woodcutting guild, one of your logs slips out of your backpack and falls nearly three stories before clunking another lumberjack in the head. Don't worry, they have 99 hitpoints.",
        "you chop down a Yew tree with a mighty swing. It goes from low-poly to no-poly.", 
        "you chop down a dead tree behind Draynor Manor. Would sitting on this stump prevent it from respawning…?", 
        "the Rellekka Vikings have invited you to go camping with them on the Hailstorm Mountains, which lie in one of the coldest regions in ModdiScape. They’ve offered you proper clothing for bracing the elements, but have requested you gather enough lightweight fire kindling for everyone to share. Ooooh boy do you love snapping twigs into smaller twigs into smaller twigs into smaller twigs!", 
        "the dwarves of the Mining Guild are in search of a means to deliver 800 cannonballs downriver to the Ferox Enclave. You suggest sending them via unmanned canoe. They ask you if you know anyone with the skills to make such a secure and sturdy vessel. You point to yourself. Your goofy grin of enthusiasm makes a couple of them raise an eyebrow, but they understand. You get to work carving a Redwood Canoe.",
        "your neighbor requests your help replacing the thatch on their roof, so you head off to the jungle and collect the appropriate amount of light thatch spars and dense thatch spars, making sure not to accidentally stumble into the fairy ring."
 
    ],

    "Combat":[
        "you clobber a gnome to death with a rubber chicken. It may be worth asking yourself: Why did I do this?",
        "you decide to test your new long range weapon - the Armadyl Crossbow - on some ducks in Falador Park. You oneshot them all, you monster.",
        "you engage in a rock-paper-scissors tournament with the recruits of the Burthorpe Imperial Guard and make it to the semi-final bracket. Just as you approach a total-sweep victory, you lose to a beef-brained Commanding Officer named Bryant. You step on his foot.",
        "while harvesting a wheat field with your scythe, you accidentally decapitate a scarecrow. Farmer Ted won't be happy when he sees this, but is he really going to know it was you?",
        "you've been given the task of killing vampyres. 55 of them, to be exact. You always carry some garlic bread in your inventory to snack on while slaying monsters, but today you decide to leave it at home and power through.",
        "you've been given the task of killing snails. You retrieve one of their shells and wear it as a helmet.",
        "you install the Door Kicker plugin. Wow. Aggressive today, are we?",
        "you engage in fisticuffs with the combat training dummy in your basement. The dummy doesn't seem very enthusiastic.",
        "Dantaera wants a sack of potatoes in exchange for tending to your strawberry patch. You wrestle with the clunky sack of potatoes in an attempt to fit it into your backpack, even going so far as to piledrive it into the pavement in front of Catherby bank. Everyone stops what they're doing and watches.",
        "you take down a Greater Demon using only the Wind Strike spell and a tearful prayer to Saradomin.",
        "everyone at the Grand Exchange wants to know your Hueycoatl kill-count.",
        "Vannaka, your favorite Slayer Master, challenges you to a bar fight in Rellekka, which you gleefully accept Because of your extensive WWE knowledge, you know jumping from a rafter beam and hitting him with a chair gives you the best chance of winning. The Fremenniks at the Rellekka longhall watch in awe as you execute this move flawlessly.",
        "you receive word that Count Draynor needs to be put to eternal rest in his crypt. Driving a stake through his heart is the only way to do it. Always one to understand the assignment, you carry out the mission LeBron James style. Sadly for you, the camera phone hasn't been invented yet.",
        "as you sip your tea under an oak tree in Varrock, you ponder to yourself, 'Do they really need this many guards patrolling the place? How many of them are even qualified for the job?'",
        "you cast Earth Bolt on one of the guards and quickly take cover behind the tree. You hear some heavy metallic clunking sounds, followed by frantic squeaking. You give a little peek, and see that the Varrock guard has turned into a rat.",
        "after an intense 63-wave boss rush deep beneath the Karamja volcano, you are finally victorious against the Fight Caves and Tz-tok Jad, and are awarded the prestigious Fire Cape. You sear a hotdog on it.",
        "feeling nostalgic, you head over to the Lumbridge cow pen for some senseless butchering. Just like the old days.",
        "a Dark Wizard in Draynor Village attempts to knock you out with a Water Bolt spell, but you clap right back with the Magic Shortbow special attack and put them in the ground. You take their wizard hat as a trophy.",
        "while digging out your basement, you realize you boxed yourself in with an aggressive green dragon between you and the ladder leading to the surface. The only tools at hand are your saw and hammer. You don't have anything to protect from its fiery breath, but still, you manage to defeat it.",
        "you're enjoying a nice day out on the Gnomeball field. You're scoring points, making friends with the locals of Gnome Stronghold, and enjoying their delicious baked goods during the ball resetting periods. A new round begins and you pass the gnomeball to your teammate in orange. The ball makes contact with the center of his face. You gain a strength level.",
        "you ask yourself if you really need those 6000 throwing knives clogging up space in your bank. You contemplate just dropping them, but after a moment of reflection, you conclude that it's a better idea to go slay a beast of some sort. You spend all 6000 of your throwing knives - and an entire afternoon - bringing the Corporeal Beast's health down from 2000 to 0.",
        "you are tasked with killing 84 bloodvelds. They love to lick your ankles.",
        "congratulations! You have completed the quest, Dragon Slayer. I wonder what that involved.",
        "the rowdy, two-thousand-pound gorillas guarding the Ape Atoll prison complex agree to teach you some neat wrestling moves in exchange for a bucket of banana milkshake. The broken ribs and severe internal bleeding you sustained sure were worth it!", 
        "you slap a level 92 Poisonous Jelly, barehanded. The palm of your hand makes the exact sound you’re imagining right now as it makes contact with the slimy cube. You slap it again.",
        "while searching for artifacts at the Misthalin Dig Site, you uncover a petrified skull. You rish it over to a senior examiner, who declares it powerfully cursed. Instead of relinquishing it to the Varrock Museum or uncovering its intended resting place, you place the skull under Moddi’s pillow, knowing all too well how cursed objects can be as deadly as grenades.",
        "on your way home from Stonecutter Outpost after a long day of stonecutting, you get ambushed by a small legion of six imps. Having accidentally left your sword at home this morning, you are forced to defend yourself with some of the stone tablets you spent all day making. Fortunately, the imps smoosh nicely under dropped tablets. So nicely, in fact, that you almost don’t resent having to remake the tablets on the morrow. Almost."

    ],
    
    "Fishing":[
        "Harry in Catherby is about to leave on a fishing trip and asks you to fill a bucket with fresh sardines. He says sardines are the best kind of bait when you're out on the open ocean. You accept.",
        "after a few hours of fishing on the beaches of Catherby, you feel a calm connection to the place. The shimmering shoreline, the blinking water obelisk, the sound of waves kissing the sand...",
        "you enter the gates of Piscatoris for the first time. Without hesitation, you pull out your net and catch a monkfish. And another. And another. And another...",
        "you determine the Fishing skillcape to be your favorite. You need 99 Fishing to obtain it. You decide to fish lobsters for 72 hours straight to make your new fantasy a reality. You put a decent chunk of XP into it, but not quite enough yet.",
        "while harpooning at Mudskipper Point, a Mogre washes up on shore, motionless and slimy. You assess their vitals. They need CPR, which you administer quickly and effectively. For saving his life, the Mogre hands you his reinforced harpoon.",
        "thirsty for some excitement, you decide to figure out the purpose of the Fishing Explosive potion that's been sitting in your bank for a few weeks. You chuck the weird-smelling vial into the sea and immediately hear crackling below the surface. A Mogre appears and bonks you on the head with his driftwood club. 'Not fishy,' he says.",
        "you decide to see what this new Fishing monster, Tempoross, is all about. Turns out, it's best to take him on with a group. You meet some like-minded friends as you demolish Tempoross with the power of fried fish projectiles.",
        "while fishing with your big net, you catch something unusual - a pair of boots. How bizarre - a pair, still together? What's even weirder is that you recognize the boots from your childhood. You wore a pair just like them whenever your dad would ask for your help in the wheat fields. You turn them over, and sure enough, the unmistakable smell of petrified Hosidious manure invades your nostrils. You have been reuniited with your own boots!",
        "after spending hours polishing your new gilded armor, you feel an intense need for someone to notice your fashionable efforts. You run over to the Grand Exchange, where conversation is always buzzing, and start screeching self-deprecatingly about your armor and 'total lack' of polishing skills. Eventually, someone chimes in to make you feel better, saying you look great and that your armor should be in a museum.",
        "a fellow fisherman notices your complete angler outfit. From top to bottom, you look like a 'reel' professional. The fisherman invites you for a few trips on the Fishing Trawler. You accept and spend hours on the boat with him and a whole crew of others. As the sun sets, you head home with a huge haul - over 300 manta rays.",
        "as the fourth hour of fishing lava eels approaches, you become a little delirious. You ask yourself why the eels come out of the lava pool raw.",
        "on a whim, you decide to cast your fishing net into the tiny man-made lake that the Varlamore sewers drain into. You catch another fishing net.",
        "out of curiosity, you cast your fishing line down into the Edgeville well. You hear a tiny clink and reel in. To your delight, you caught a diamond ring!",
        "congratulations! You caught a Big Shark. A one in 5000 chance. Go on, hang that up in your house!",
        "congratulations! You've completed the quest, Fishing Contest. You 'pulled the biggest honker,' as they say.",
        "you spend your weekend fishing swordfish. A wild heron pays you a visit...",
        "you spent this morning catching a variety of fish, in the hopes of concocting the perfect Fish Pie recipe. Now if only you could catch a pie dish...",
        "no matter what the Ecosystem Maintenance Experts say, the eels in the Lava Lake are free. You can take them home. Nobody will stop you.", 
        "ah, crud! You dropped your Ring of Wealth into the Rellekka Vikings’ communal toilet. Sometimes there’s nothing you can do except reach in and start grabbing… You found it! Maybe they’ll let you use the communal water tap…",
        "you grab your barbarian fishing rod and a pile of feathers, and spend a relaxing day catching leaping sturgeon, trout, and salmon."
 
    ],

    "Mining":[
        "while chipping away at a huge chunk of dirt with your new dragon pickaxe, you uncover an old chest. Inside the chest is another dragon pickaxe.",
        "while exploring the ice caverns below White Wolf Mountain, an Ice Giant approaches you, complaining of a migraine. He says you could do him a favor with your pickaxe. After pointing to a spot on the back of his head, the Ice Giant gives the signal, and you dislodge a large piece of copper with a single calculated swing.",
        "the Coalition of Giant Mole Hunters is recruiting for the position of Lair Destroyer. The job is simple: weaken the walls of the Giant Mole's lair to the point of crumbling, so that she has fewer places to roam and evade attacks. You sign an eight-week contract for the position, and get to work right away, carrying in tow your trusty adamant pickaxe.",
        "the ogres of Gu'Tanoth need some special dense dirt for their organic cannonballs. They commission you to mine 500 'heavy backypackies' of dirt and unload it near the city gates. You accept.",
        "the watchmen of Yanille are commissioning a new limestone staircase that will spiral up to the top of the watchtower. They've asked you to mine the limestone for them - 30 large bricks should be enough. You accept.",
        "you spend an afternoon striking your rune pickaxe against the Shilo Village gem rocks, hoping for a big winner. Emerald... Emerald... Jade... Sapphire... Ah, a diamond!",
        "you feel like upgrading your kitchen hardware to something a little more stylish. Solid gold is the new trend. You've seen it in all your friends' houses. You spend half a day mining gold ores and hope it's enough when it's all smelted down.",
        "after a tiring day of activities, you decide to have a rest and watch the sun set over Catherby beach. As your feet sink into the sand, you drop your iron pickaxe right at your side. It makes a strange thud - like metal on metal. You scoop away the sand and find a gold emblem with a 'B' engraved on it. After taking it to the Varrock Museum to be examined, you are informed that you can name the object, as nothing like it in ModdiScape has ever been found before. You name it Bitcoin.",
        "while exploring the Varrock sewers, you stumble upon a tribe of Earth Warriors. To your surprise, they don't seem hostile - in fact, they appear to need help. Their newest comrade, a recruit fresh from training on Death Plateau, seems to be buried under a rockslide. You spring into action with your mithril pickaxe and save the panicking warrior.",
        "after carefully planning an expedition to Ice Mountain, you realize too late that you forgot your mithril grapple - your only means of exiting the caverns below. Thankfully, you were smart enough to carry your pickaxe with you, which you use to scale the cave walls. Tiny shards of minerals collect in your boots as you swing and climb.",
        "Martin the Master Farmer summons you to Draynor Market to assist in appraising crop types. He hands you a few coconuts and asks if you've seen them before, to which you say yes. He asks you if they have a purpose, to which you reply by breaking it open with your trusty steel pickaxe. Martin is about to get drunk off piña coladas - he just doesn't know it yet.",
        "Aubury, the runecrafting skillmaster, admits to you he hasn't been to the Rune Essence mine in many years. He ponders the possibility (and potential implications) of Rune Essence losing energy over time if it remains stagnant in the ground, and asks you to go to the mines and retrieve some Essence for him to examine. You agree to mine 100 Rune Essence.",
        "after spending a month in Varlamore to complete quests and explore, you feel a bit beaten up by the scorching, dry heat. A quick excursion to the icy Pure Essence mines suits your fancy. The cold, swirling winds feel incredible against your skin, but you get carried away, and end up mining over 4000 Pure Essence during your time there.",
        "you are summoned to Al-Kharid by the Royal Guard. They tell you that Giant Scorpions are terrorizing the city, and the palace guards are simply outnumbered. You hatch a plan to lure the scorpions to the strip mine to the east, and trap them there. After mining and gathering a ton of sun-baked rocks from the desert, you stack them in front of the mine entrance with every last scorpion - and a sweaty goblin criminal you talked into being bait - secured inside.",
        "the great Sphinx of Sophanem requires your assistance. The sentient cat sculpture has developed a severe case of cataracts, and needs you to remove them. With your skilled and steady hand, you use your rune pickaxe to knock the calcified cataracts out of the Sphinx's eyes.",
        "today, you felt like doing something stupid, so you ventured into the Wilderness, carrying nothing but your rune pickaxe. You spent the entire afternoon fighting over a single runite rock. Other players were swarming it when you got there, like a pack of hungry coyotes. Luckily, you scored a few ores in all the chaos and bloodshed.",
        "you spend an entire day mining gold, expecting to feel like the richest person alive afterwards.",
        "you decide to widen the entrance to your basement to better accommodate rowdy party guests. The Drive N’ Dig hasn’t been invented yet, so it’s up to your pickaxe and determination to get the job done.", 
        "enough is enough! The Lumbridge Swamp dungeon, with its winding passageways and steep dropoffs, is beginning to take a toll on your knees - you’re not as limber as you once were. You take it upon yourself to mine out some staircases in the areas you find most inconvenient to traverse, which does damage to every part of your body except your knees. At least your aches and pains are balanced now.",
        "you decide to add a new basement to your house, and start digging with great gusto! Much to your surprise, you find a pile of pay-dirt buried under your house. Oh happy day!"


    ],

    "Cooking":[
        "the residents of Taverley, a peaceful community of druids, are inexplicably feuding with one another. This really kills your vibe whenever you have to cross the main pathway that separates Taverley and Burthorpe. You devise a plan to restore peace and friendship. After asking each druid their favorite flavor of pie, you get to work in your kitchen, spending hours in front of a hot oven. While they're still warm and fragrant, you hand a pie to each druid, claiming emphatically that a neighbor knew it was their favorite and baked it for them, and you're just the delivery guy.",
        "gnomes really love their food and drink, and so do you. In fact, you enroll in a comprehensive 12-week culinary program at the Grand Tree, where the most famous gnome chefs made themselves known. With open arms, they teach you everything they know.",
        "Rantz, the chompy-hunting Ogre, has requested your help babysitting his two children, Fycie and Bugs. Rantz taught you how to hunt birds, so you decide to do this favor for him. He says his kids are generally well-behaved, but can be picky eaters. You decide to excite them by bringing a huge variety platter of Toad Crunchies, all with elaborate toppings and fillings. They seem to enjoy the dirt-filled Crunchies, topped with dandelion seeds. Both of them tell their dad you're the best babysitter in Kandarin.",
        "Lanthus, the supervisor of the Castle Wars minigame, is trying to strike up a deal with the Burthorpe Imperial Guard. He's overstocked with bandages and would like to give them to the growing battalion of troops in exchange for 'something delicious.' The guard's Commander, Denulth, offers two crates of standard issue MREs. Lanthus declines. You tell Denulth you'll sort this out and that the bandages are on the way. You bake a chocolate cake for Lanthus, which he happily accepts.",
        "after traversing the Lumbridge Swamp and reaching the castle, you make a comment to the cook that the giant swamp frogs roaming around there look awfully edible. He tells you quite point-blankly that they're imported from a far-away land called Haribo. You ask him if he knows what they taste like, to which he replies, 'Exactly what you would think they taste like.' Your mouth waters a little.",
        "after several failed attempts, you finally manage to bake a Fish Pie. Holy mackerel, that stinks.",
        "congratulations! You've completed the quest, Cook's Assistant. You assisted the cook. (And by 'assisted,' I mean you did literally everything necessary to bake a cake while the poor, incompetent sap in a chef's hat stood and watched.",
        "after catching a full inventory of 28 swordfish, you manage to cook 22 of them.",
        "after catching a full inventory of 28 monkfish, you successfully cook 19 of them.",
        "you catch a full inventory of 28 tuna, and immediately run to the cooking range. You burn only five of them.",
        "much like in real life, you bake 9 pizzas and eat all of them before the day is over. The whole 'having to heal hitpoints' thing is a real drag sometimes. You can appreciate a fresh tomato sauce, though.",
        "you prepare what can only be described as the most aesthetically astonishing Dragonfruit Pie the world of ModdiScape has ever seen. The crystal sugar topping sparkles in the light, just like in the fairytale books. But the world hasn’t seen it, has it? And it never will, will it? Because you ate the whole thing with your bare, unwashed hands, and yet with your body leaning over your kitchen sink like a few crumbs on the floor would be bothersome.",
        "you decide to make the best of Moddi’s earlier shenanigans and cook up all of the dark crabs Moddi caught with your lobster pots. Turns out, dark crab is nutritious and delicious!"

    ],

    "Hunter":[
        "you see a lone Abyss Runecrafter heading toward the Wilderness teleport. Without missing a beat, you equip your best magic gear, hop over the Wilderness ditch, and obliterate their existence before they can enter the interdimensional rift. Bet you feel pretty good about killing a defenseless skiller, don't you?",
        "it's your first visit to the Avium Savannah. You spot a Sunlight Antelope and swiftly set up your deafall trap. Success - the antelope falls for it.",
        "you spot an empty vial on the ground. After picking it up, you see another, just a few tiles ahead. And another... and another. The trail of vials seems to be leading you somewhere. Oh, it's PentaHybrid... training Herblore again.",
        "while chopping logs in Seers' Village, you spot a squirrel, just chilling on a yew branch. You offer it an acorn from your backpack. The squirrel is grateful and sits on your shoulder for a while.",
        "lots of salamanders roam outside the Ourania Altar. With your exceptional hand-eye coordination, you manage to catch them all as other hunters watch on, empty-handed and in disbelief.",
        "while mining in Al-Kharid, you make an interesting discovery: Giant Scorpions love chocolate. You successfully lure one into a net trap with a tasty bar of chocolate as bait, then pass the information on to D-Hex.",
        "as you approach the Slayer Tower in Morytania, you spot a large pile of bones on the path. You lift away some of the larger bones and find a family of rats, just starting to build a nest. Knowing the vampyre-infested area, you decide to lure them out and relocate them to a safer area. One inventory of cheese slices later, the mission is complete.",
        "with your heart set on efficiency, you attempt to devise a new way of catching chinchompas in the Feldip Hills. Instead of leaving bait out on the ground, you're going to be the bait yourself. You slather your entire body in pulverized seaweed, the chinchompas' favorite. Your method works perfectly - within half an hour, hundreds of them are crawling into your backpack.",
        "it seems your pet raccoon has gone missing from your menagerie. You lay some garbage outside your house portal, and wait behind a bush. Sure enough, Rocky returns a few hours later. You scoop him up into your arms.",
        "congratulations, you completed the quest, Twilight's Promise. You now have both the skills and permission to navigate around Varlamore on the back of a quetzal.",
        "in a matter of moments - it seemed like no time at all to you - you caught a full inventory of polar kebbits and make some nice fur pelts.",
        "you skillfully catch a Ninja Impling with your bare hands.",
        "you successfully catch a Gourmet Impling with your bare hands.",
        "you spend a day improving your approach with bird snares. Your reward is a backpack full of colorful feathers.",
        "congratulations! You have completed the quest, Eagle's Peak. You never knew the true size of an eagle before this...",
        "while camping on Fossil Island with some friends, you spot a bush that is moving suspiciously. You quickly realize that you’re looking at a herbiboar, and decide to catch it so your friend can cook it for dinner. It was just as delicious as you thought it would be!"

    ],

    "Construction":[
        "you build a miniature mansion for your new pet kitten. He loves it!",
        "after a long day of hunting critters on the Avium Savannah, you set up camp for the night. You've never assembled a tent before, but you get the job done.", 
        "it's the Lumbridge Guide's birthday today. You decide to repair the crumbling well behind the castle for him.", 
        "Farmer McGrubor commissions you to repair a 30-foot section of his wrought iron fence. Despite the aggressive guard dog staring at you and frothing at the mouth the whole time, you get the job done.", 
        "on your way to the Rellekka docks, you spot the abandoned coal trucks. You take a moment to wonder why nobody uses them anymore, and approach one of the carts to investigate. It's completely rusted. You decide to build a stone enclosure over the end of the tracks to keep them from becoming even more damaged by the elements. Perhaps some residents will begin to use the coal trucks again.", 
        "you finally find the time to deck out the Observatory in your house, complete with a moving model of the solar system. You feel like Galileo.", 
        "you finally get around to installing a toilet in your house. And by 'installing,' I mean you dug a nice hole in the basement.", 
        "after numerous complaints from house party guests, you finally reinforce the combat dummy in the corner so that it can withstand repeated greatsword special attacks.", 
        "you build a four-poster bed. Woah there, fancy pants.", 
        "the spectral disciples of the Ectofuntus have requested your help. They'd like a handrail for each of the two staircases leading down to the slime pit. You accept, and construct two handrails out of blessed marble.", 
        "congratulations, you completed the quest, Daddy's Home. (Yes, you're the Daddy.)", 
        "just as the many generations of skillers did before you, you enter Building Mode and begin the cycle of building, and then immediately breaking down, the same oak parlor chair over and over and over and over and over and over and over and over and over and over again.", 
        "you build a full-length mirror for your bedroom, complete with hand-carved details.", 
        "look at that! You carved a cape rack in just one afternoon. Now you have a place to store your nonexistent skillcapes!",
        "you enter the presumably haunted Draynor Manor and immediately come face-to-face with a bizarre animated chair. It stumbles from room to room on its back legs, creaking loudly and roughing up the old wood floors as if it’s angry at something. You chop the chair in half with your axe to put it out of its misery.", 
        "It has taken you months and months, and millions of gold coins, but finally, you have finished the exterior renovations on your house. They now reflect the airy, summery vibes of Aldarin, a beautiful island just off the coast of Varlamore.",
        "after several long months of grinding, you finally have the money and resources to build a portal nexus in your house. You’re not entirely sure how you managed to install it upside down on the ceiling in your exuberance, but it’s only a few minutes of work to take it apart and re-install it the right way around."

    ],

    "Prayer":[
        "congratulations! You've completed the quest, Priest in Peril. You feel so much more holy. So spiritual.", 
        "the monks at the Monastery bless your Saradomin amulet in exchange for a bundle of pale blue Trollweiss flowers.", 
        "you spot some wretched-looking swamp logs in Morytania and decide to bless them with your magical silver sickle. Brightly-colored mushrooms begin to bloom on the logs, almost enthusiastically. You made the Mort Myre Swamp a little more beautiful.", 
        "you calmly kneel and bless the stray dog in the rundown sector of Varrock. The dog's fleas disappear and a glimmer of happiness pangs through its eyes. You feel like you should do this more often.", 
        "the stray dog of Hosidius, who often hangs around the central market, is now accompanied by a pack of puppies. You kneel and bless the family as it searches for food.", 
        "you manage to find the last page of your damaged Prayer book and insert it into the right spot. Your Prayer book is now blessed and even more powerful against the dark forces of the gods.", 
        "you make fantastic use of the Steel Skin prayer while breaking up with your ModdiScape girlfriend.", 
        "you drink from the Holy River Salve. It tastes like boiled mushrooms, but you feel strengthened and energized.", 
        "the Nature Spirit blesses your monk robes. You turn completely green, matching the Spirit, but you feel surrounded by the otherworldly magic of the strange swamp where he resides.", 
        "the fairies of Zanaris have requested your help. Their only medical professional, Fairy Nurse, is sick herself and is showing no signs of getting better. A blessing may help her - it's their last hope. You bless the delicate little fairy with Rapid Heal. It works like a charm - the fairies are eternally grateful.", 
        "the Fairy Queen blesses your farming secateurs. Holding these increases the yield of every crop you grow.", 
        "a group of bullies has targeted you, launching insults from across the Grand Exchange. You pray Protect from Missiles and are completely unaffected.",
        "you swallow an entire monkfish in one pious gulp and feel more spiritually connected to the world of ModdiScape than you ever have before.",
        "your favorite place in ModdiScape is the shimmering Cosmic Rune Altar, with its otherworldly atmosphere and oscillations of calming light. Whenever you journey there, you linger for a long while, taking it all in, syncing your breaths to the heartbeat of the universe. It is the only place where you can confidently say you feel blessed to be in, and magnetically tethered to, this world of ModdiScape. You thank your inner self for persisting, even through the difficult hours, and smile with thoughtful gratitude towards the spiritual forces that guide you. Too bad there isn’t a bathroom in there.", 
        "you kneel and give blessings to Gertrude’s new litter of eight kittens. You pray for their protection and health, as instructed by the Book of Saradomin.", 
        "you stumble upon a sickly capybara on the outskirts of Varlamore’s Civitas Illa Fortis. You reflexively reach into your backpack, pull out your prayer book, and recite Rapid Heal to the ailing rodent. The cloudiness in its eyes fades away. It gives you a happy snort and begins looking for some wheat to chew on.", 
        "while the livestock vendor of Draynor Market is distracted, you stealthily bless his pen of adorable piglets. They are now and forever protected from becoming bacon.", 
        "while tending to your tomato plants, you notice a young woman crying near her flower patch. You approach her and ask what’s wrong. She explains that she wanted to carry a single White Lily down the aisle at her wedding, but her seedling succumbed to disease. You tell her it’s going to be alright, and place your hand in the soil. You recite an incantation passed on to you by Otto, the Nature Spirit, which revives the Lily plant. You then trim off the largest bloom with your blessed secateurs, ensuring it will never wilt. The bride-to-be hugs you and rushes to the nearby altar.",
        "upon finding the lair of an evil necromancer and fighting your way to the heart of their lair, you are obligated to listen to their evil monologue, especially as it’s probably free entertainment. 20 minutes later, you’re still not sure what their name is, or what they’re talking about, so you throw a rock at them to start the fight and are surprised when they fall over dead."

    ],

    "Crafting":[
        "congratulations! You've completed the quest, Elemental Workshop. You made a shield out of magical essence, or something. It's purple.",
        "the tall and foreboding ruler of Miscellania, King Vargas, has requested a pair of winter boots. You check your bank for materials and find you have everything you need to fulfill his wish. You're able to deliver the gigantic pair of boots the very next day.",
        "using your last 12 Mithril seeds, you plant some flowers and weave a beautiful floral crown. Very wholesome.",
        "the Ardougne zookeeper needs a magical trough to store and serve feed to the unicorns. You remember you have a reserve of Magic Logs in the bank, and offer to take on the task.",
        "after many weeks of gathering pheasant feathers, you can now craft the elusive Pheasant Costume set.",
        "you feel a little weird about it, but ultimately decide to steal a snake's skin right off its body while it was mid-molt and craft some lightweight armor with it. You're not sure how you didn't get bitten.",
        "the Demon Sergeant invites you to his rigorous new Looksmaxing bootcamp. You craft an entirely new physique for yourself and come out of the experience carrying the confidence of an absolute Chad.",
        "you spend a few hours cutting gems you received as monster drops. Out of about a hundred diamonds, only 18 of them get crushed into useless dust. Nice, you're getting better!", "the Ranging Guild admin has requested 3500 bowstrings to equip its target practice instructors with new longbows. As much as you hate the monotony of spinning flax into bowstrings, you know it's pretty decent XP.",
        "you receive a Curved Bone as a drop from a Moss Giant. On a rainy afternoon, cozied up next to your fireplace, you whittle the bone into a nice comb for your hair. After one use, you're enthralled with the feeling of freeing your hair of smelly buildup. You make a daily routine of it. Now if only there were something like this for teeth...",
        "it’s official - your new artsy hobby is needle-felting. You are so obsessed with the craft that you hop Farmer Fred’s fence, shear one of his sheep without his permission, and use its wool to felt a smaller, considerably less alive replica of the exact same sheep. What is wrong with you?", 
        "the monkeys of Ape Atoll invite you to train on their new agility course. The standout feature of the course is - you guessed it - monkey bars. A 60-foot assembly of monkey bars that crosses over a craggy river valley, at that. Thankfully, you knew of its precarious nature beforehand and weaved a rope net to attach beneath the monkey bar apparatus. It catches you every time you fall, saving you from certain death and the time-transcendent echoes of monkey laughter.",
        "after spending all day hunting crabs, you finally have everything you need to make crab armor for all of your friends, causing an impromptu crustacean cosplay."

    ],

    "Thieving":[
        "you steal two loaves of bread from the Ardougne market stall and assemble a bread sandwich.",
        "you pickpocket a portly Varrock guard and receive a nice-looking triangle sandwich. You break it into pieces and feed it to a struggling stray dog.",
        "you steal a hammer from the Sawmill Operator's toolbelt and proceed to knock him unconscious with it. For a solid hour, you're able to cut logs into planks, unchallenged.",
        "pickpocketing a ghost goes about as well as you would expect. Maybe you received an item - maybe you didn't. You really can't tell. You got some XP, though.",
        "you steal a handful of barley seeds from the Master Farmer, only to realize... you BARLEY have enough room in your backpack for them.",
        "you pickpocket a thrower troll and receive one of your own teeth... Huh? It must be from the time you got nailed in the face by a rock he threw. He took your tooth as a trophy.",
        "you come across two ogres guarding a locked chest. You distract the ogres with a book of Dad jokes and manage to unlock the chest while they accuse each other of being illiterate.",
        "Varlamore is a hub for conniving thieves. You prove yourself to be one of them as you steal dozens of house keys from people in broad daylight.",
        "you steal some silver from the Ardougne Market stall. You genuinely have no idea what to do with a piece of silver.",
        "you steal a spice shaker from the Hosidius Market stall. You now have everything you need to make ModdiScape's first enchilada.",
        "you hop the fence into the Garden of Tranqulity and steal a bunch of strange fruits.",
        "feeling confident, you decide to pickpocket Martin Thwait, the Thieving skillmaster. You receive a rolled up piece of paper. You unroll it and reveal a floorplan of your own house. Just back away slowly...",
        "after watching some Menaphite Thugs shakedown all of your merchant friends for ten times the entrance fee they should be charging, you decide to take matters into your own hands and steal the excess fee from their pockets."
    ],

    "Farming":[ 
        "as you approach your farming patches on the outskirts of East Ardougne, you catch the first glimpse of your harvest. You swiftly equip your magic secateurs and manage to snag 14 tarromin herbs, as well as an extra serving of armpit sweat.", 
        "you carefully pluck some poison ivy berries from your bush allotment in Rimmington, whistling to yourself as you acquire a rash on your arms.", 
        "you equip your Amulet of Bounty and approach your farm, south of Falador. Using your recently-learned Barbarian Training, you punch some watermelon seeds into the dry soil.", 
        "feeling confident and emembering Otto the Barbarian’s farming training, you sprint to the Lumbridge tree patch holding a potted oak sapling knowingly above your head. You slam it into the soil, crushing the pot to dust in the process. That probably wasn’t necessary, but you felt like Hercules anyway.", 
        "after planting some high-level seeds, you circle back around your allotments, sprinkling ultracompost on everything to ensure healthy plants and bountiful harvests The back pain will go away eventually.", 
        "you grab your basket of harvested Snape grass from the farming guild allotment and hand it in to Jane the Guildmaster, completing your contract duties. She hands you a Seed Pack as payment, which you happily rip open as you run to the bank chest. Hey, multitasking is a tripping hazard!", 
        "you approach your farm near Port Phasmatys and realize it’s been overtaken by weeds. You forgot to plant seeds there. Begrudgingly, you grab the nearby rake, clear the weeds, and chuck some random seeds down into the dirt. Better luck next time, cabbage-brain.", 
        "after a long several hours at the Tithe Farm, you lock your exhausted eyes with its owner, Farmer Gricoller, and drop a sack of Bologano Fruits at his feet. A smile emerges on your face, and his. You know what’s coming: Gricoller hands you a hefty armful of Seed Packs as a thanks for your work. You also buy a straw hat from his shop while you’re there. It makes your scalp itch a little.", 
        "in the spirit of seeking some new experiences, you spend the afternoon in Troll Stronghold, taking agricultural mentorship from a squat little troll named My Arm. You come away both educated about growing herbs and confused about literally everything else. Just before departing, My Arm tells you the tale of why trolls are named after the first thing they eat.", 
        "you pay close attention as you pick the spines off the cactus you grew in the desert town of Al-Kharid, making sure you get every last one. Lucky for you, the bottom of your foot also found one sticking straight up out of the ground! Now THAT’S maximizing profit.", 
        "you shake your orange tree to harvest it. Because this isn’t Animal Crossing, you receive way more than three oranges. In fact, you get way more than you can carry in one basket.", 
        "You take it upon yourself to relocate a rare Varlamorean Oak tree to Falador park, where the ducks can enjoy its shade and the uneducated can maybe get a book or two in, undisturbed.", 
        "a strange plant bursts up through the ground right next to where you’re standing. You feel a sense of calm understanding that the plant wants you to the large fruit it’s baring in your direction. You fearlessly pluck the fruit and eat it. It bursts with tanginess in your mouth and restores your stamina.",
        "after several hours of hard work, you’ve finally filled your entire inventory with strawberries, at which point you promptly shove them all in your face. There’s nothing quite like eating fresh strawberries!" 
    ]
}